Documents/МГС_ОтгрузкаБаллонов_.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МГС_ОтгрузкаБаллонов_</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МГС_ВыпускБаллонов_</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБаллоновВОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВладельцаКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МГС_Контейнеры_</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЩитДеревянныйКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозвратаТары</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПлательщика12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПлательщика7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОттиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОттиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПломбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартииБаллоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выпуск</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.МГС_ВыпускБаллонов_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииБаллоныРезервированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выпуск</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.МГС_ВыпускБаллонов_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баллон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МГС_ОтгрузкаБаллонов_/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	//Если ДанныеЗаполнения<> Неопределено Тогда
	//	ЭтотОбъект.Организация = ДанныеЗаполнения.Организация;
	//	ЭтотОбъект.ДокументВыпуск = ДанныеЗаполнения;
	//КонецЕсли;
	ЭтотОбъект.ДатаВозвратаТары = Документы.МГС_ОтгрузкаБаллонов.ПолучитьДатуВозвратаТары(   ЭтотОбъект.Реализация,ЭтотОбъект.Дата);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр МГС_ВыпускБаллонов
	Движения.МГС_ВыпускБаллонов.Записывать = Истина;
	Для Каждого ТекСтрокаБаллоны Из ПартииБаллоны Цикл
		Движение = Движения.МГС_ВыпускБаллонов.Добавить();
		Движение.Период = Дата;
		Движение.Баллон = ТекСтрокаБаллоны.Баллон;
		Движение.Партия = ТекСтрокаБаллоны.Партия;
		Движение.Выпуск = ТекСтрокаБаллоны.Выпуск;
		Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Отгружено;
		Если ВидОтгрузки =2 Тогда
			Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Резервировано;		
		КонецЕсли;		
		Движение.Номенклатура = Номенклатура;
	КонецЦикла;
	
	Для Каждого ТекСтрокаБаллоны Из ПартииБаллоныРезервированные Цикл
		Движение = Движения.МГС_ВыпускБаллонов.Добавить();
		Движение.Период = Дата;
		Движение.Баллон = ТекСтрокаБаллоны.Баллон;
		Движение.Партия = ТекСтрокаБаллоны.Партия;
		Движение.Выпуск = ТекСтрокаБаллоны.Выпуск;
		Движение.Состояние =Перечисления.МГС_СостояниеБаллона.Отгружено;	
		Движение.Номенклатура = Номенклатура;
	КонецЦикла;
	
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МГС_ОтгрузкаБаллоновПартииБаллоны.Баллон.ТипБаллона КАК ТипБаллона,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.МГС_ОтгрузкаБаллонов.ПартииБаллоны КАК МГС_ОтгрузкаБаллоновПартииБаллоны
		|ГДЕ
		|	МГС_ОтгрузкаБаллоновПартииБаллоны.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МГС_ОтгрузкаБаллоновПартииБаллоны.Баллон.ТипБаллона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МГС_ОтгрузкаБаллоновПартииБаллоныРезервированные.Баллон.ТипБаллона,
		|	СУММА(1)
		|ИЗ
		|	Документ.МГС_ОтгрузкаБаллонов.ПартииБаллоныРезервированные КАК МГС_ОтгрузкаБаллоновПартииБаллоныРезервированные
		|ГДЕ
		|	МГС_ОтгрузкаБаллоновПартииБаллоныРезервированные.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МГС_ОтгрузкаБаллоновПартииБаллоныРезервированные.Баллон.ТипБаллона";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Движения.МГС_БаллоныУКонтрагентов.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Движение = Движения.МГС_БаллоныУКонтрагентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТипБаллона = ВыборкаДетальныеЗаписи.ТипБаллона;
		Движение.Контрагент = Контрагент;
		Движение.ДокументОтгрузки = Ссылка;
		Движение.Количество =ВыборкаДетальныеЗаписи.Количество;	
	КонецЦикла;
	
	//Если ЩитДеревянныйКоличество <> 0 Тогда
	//	Движение = Движения.МГС_БаллоныУКонтрагентов.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Организация = Организация;
	//	Движение.ТипБаллона = Справочники.МГС_ТипыБаллонов.ЩитДеревянный;
	//	Движение.Контрагент = Контрагент;
	//	Движение.ДокументОтгрузки = Ссылка;
	//	Движение.Количество =ЩитДеревянныйКоличество ;			
	//
	//КонецЕсли; 
	
	
	Если ВидОтгрузки =2 Тогда
		Движения.МГС_БаллоныУКонтрагентов.Очистить();		
	КонецЕсли;	
		
	
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	Если ВидОтгрузки =2 Тогда
		КоличествоБаллоновВОтгрузке = ПартииБаллоны.Количество();
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОтгрузки =2 Тогда
		ИндексРеализация = ПроверяемыеРеквизиты.Найти("Реализация");
		Если ИндексРеализация <> Неопределено Тогда
			ПроверяемыеРеквизиты.удалить(ИндексРеализация)	   
		КонецЕсли; 
		ИндексКонтрагент = ПроверяемыеРеквизиты.Найти("Контрагент");
		Если ИндексКонтрагент <> Неопределено Тогда
			ПроверяемыеРеквизиты.удалить(ИндексКонтрагент)	   
		КонецЕсли; 
	иначе
		//Если КоличествоБаллоновВОтгрузке <> ПартииБаллоны.Количество()+ ПартииБаллоныРезервированные.Количество() Тогда
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Количество выбранных баллонов ("
		//	+ПартииБаллоны.Количество()+") не соответствует общему колучеству в реализации ("
		//	+КоличествоБаллоновВОтгрузке+")";
		//	//Сообщение.Поле = "";
		//	//Сообщение.УстановитьДанные();
		//	Сообщение.Сообщить();
		//	Отказ = истина				
		//КонецЕсли; 
	КонецЕсли; 
	
	// Вставить содержимое обработчика.
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(МГС_ОтгрузкаБаллонов.Номер) КАК Номер
		|ИЗ
		|	Документ.МГС_ОтгрузкаБаллонов КАК МГС_ОтгрузкаБаллонов
		|ГДЕ
		|	МГС_ОтгрузкаБаллонов.Дата >= &ДатаОтбора";

	Запрос.УстановитьПараметр("ДатаОтбора",ДобавитьМесяц(ТекущаяДатаСеанса(),-6));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		НомерДокаПолный =  ВыборкаДетальныеЗаписи.Номер ;
		// Вставить обработку выборки ВыборкаДетальныеЗаписи  
		НомерСимволДефис = СтрНайти(НомерДокаПолный,"-");
		Если  НомерСимволДефис>0 Тогда
			НомерДока = Число(Прав(НомерДокаПолный,СтрДлина(НомерДокаПолный)-НомерСимволДефис)); 
			Если  НомерДока>=999 Тогда
				ПрефиксДока = Число(Лев(НомерДокаПолный,НомерСимволДефис-1)) ;  
				ПрефиксДокаСледующий =ПрефиксДока+1; 
				Префикс = Формат(ПрефиксДокаСледующий,"ЧЦ=4; ЧВН=; ЧГ=0")+ "-"
				
			КонецЕсли
			
		КонецЕсли
	КонецЦикла;

КонецПроцедуры
